// Example program
// #include <iostream>
// #include <string>

#include <iostream>
#include <cmath>

using namespace std;

int main(){
{
    // Суму S квадратів усіх елементів, що перевищують 10 по абсолютному
    //значенню і їхню кількість К.
    // Кожен елемент від -10 до 10 піносиш до квадрату і знаходиш їхню суму
    // І кількість цифр від -10 до 10:
    
    int n = 10, k = 0;  // блок неявного вводу/выводу. - тіпа давайте повіримо шо є такі
    //люди які це ПЧатают!
    
    float sum = 0;  // Блок обробки данных - ініцілізація.
    
    for (int i = -abs(n), m = abs(n); i <= m; i++){
        sum += pow(i, 2);  // блок обробки данних.
        k++;
    }
    
    cout << sum << " " << k << "\n";  // блок вводу.выводу.
    }
    
    // або:
    {
    // Суму S квадратів усіх елементів, що перевищують 10 по абсолютному
    //значенню і їхню кількість К.
    // Cума елементів конкретного масиву:
    
    int sum = 0, k = 0;  // Блок обробки данных - констаннта.
    
    int array[3][3] = {
        {1, 2, 3},
        {300, 1, 2},
        {2, 3, 1}
    }, n = 3;  // блок неявного вводу/выводу. - тіпа давайте повіримо шо є такі люди які це
    //ПЧатают!
    
    for (int j = 0; j < n; j++){
        for (int i = 0; i < n; i++){
            if (abs(array[j][i]) > 10){
                sum += array[j][i];  // блок обробки данних.
                k++;
            }
        }
    }
    
    cout << sum << " " << k << " ";  // блок вводу/выводу.
    }
}
